nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    if (survey_res->channel_time_rx)
    {
        (void)memcpy((void *)&survey->channel_time_rx, (const void *)&survey_res->channel_time_rx,
                     sizeof(survey->channel_time_rx));
        survey->filled |= SURVEY_HAS_CHAN_TIME_RX;
    }

    if (survey_res->channel_time_tx)
    {
        (void)memcpy((void *)&survey->channel_time_tx, (const void *)&survey_res->channel_time_tx,
                     sizeof(survey->channel_time_tx));
        survey->filled |= SURVEY_HAS_CHAN_TIME_TX;
    }

#ifdef CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.survey_res(wifi_if_ctx_rtos->hapd_drv_if_ctx, survey, more_res);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.survey_res(wifi_if_ctx_rtos->supp_drv_if_ctx, survey, more_res);
    }
}

void wifi_nxp_wpa_supp_event_proc_auth_resp(void *if_priv, nxp_wifi_event_mlme_t *auth_resp, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;
    const struct ieee80211_mgmt *mgmt = NULL;
    const unsigned char *frame        = NULL;
    unsigned int frame_len            = 0;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    frame     = (const unsigned char *)auth_resp->frame.frame;
    frame_len = auth_resp->frame.frame_len;
    mgmt      = (const struct ieee80211_mgmt *)frame;

    if (frame_len < 4 + (2 * WIFI_ETH_ADDR_LEN))
    {
        supp_e("%s: MLME event too short", __func__);
        return;
    }

    if (frame_len < 24 + sizeof(mgmt->u.auth))
    {
        supp_e("%s: Authentication response frame too short", __func__);
        return;
    }

    memset(&event, 0, sizeof(event));

    memcpy(event.auth.peer, mgmt->sa, ETH_ALEN);

    event.auth.auth_type = le_to_host16(mgmt->u.auth.auth_alg);

    event.auth.auth_transaction = le_to_host16(mgmt->u.auth.auth_transaction);

    event.auth.status_code = le_to_host16(mgmt->u.auth.status_code);

    if (frame_len > 24 + sizeof(mgmt->u.auth))
    {
        event.auth.ies     = mgmt->u.auth.variable;
        event.auth.ies_len = (frame_len - 24 - sizeof(mgmt->u.auth));
    }

    wifi_if_ctx_rtos->supp_callbk_fns.auth_resp(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
}

void wifi_nxp_wpa_supp_event_proc_assoc_resp(void *if_priv,
                                             nxp_wifi_assoc_event_mlme_t *assoc_resp,
                                             unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;
    const struct ieee80211_mgmt *mgmt              = NULL;
    const unsigned char *frame                     = NULL;
    const unsigned char *req_frame                 = NULL;
    const unsigned char *bssid                     = NULL;
    unsigned int frame_len                         = 0;
    unsigned short status                          = WLAN_STATUS_UNSPECIFIED_FAILURE;
    enum sta_connect_fail_reason_codes reason_code = STA_CONNECT_FAIL_REASON_UNSPECIFIED;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    frame     = (const unsigned char *)assoc_resp->frame.frame;
    frame_len = assoc_resp->frame.frame_len;
    req_frame = (const unsigned char *)assoc_resp->req_ie;

    mgmt = (const struct ieee80211_mgmt *)frame;

    if (frame_len < 24 + sizeof(mgmt->u.assoc_resp))
    {
        supp_d("%s: Association response frame too short", __func__);
        bssid       = (unsigned char *)&wifi_if_ctx_rtos->attempt_bssid;
        reason_code = STA_CONNECT_FAIL_REASON_ASSOC_NO_RESP_RECEIVED;
        goto fail;
    }

    memset(&event, 0, sizeof(event));
    memset(&wifi_if_ctx_rtos->assoc_bssid, 0, ETH_ALEN);

    status = le_to_host16(mgmt->u.assoc_resp.status_code);

    bssid = mgmt->bssid;

    if (status != WLAN_STATUS_SUCCESS)
    {
    fail:
        wifi_if_ctx_rtos->associated = false;
        event.assoc_reject.bssid     = bssid;

        if (frame_len > 24 + sizeof(mgmt->u.assoc_resp))
        {
            event.assoc_reject.resp_ies     = (unsigned char *)mgmt->u.assoc_resp.variable;
            event.assoc_reject.resp_ies_len = (frame_len - 24 - sizeof(mgmt->u.assoc_resp));
        }

        event.assoc_reject.status_code    = status;
        event.assoc_reject.reason_code    = reason_code;
        event.assoc_reject.timeout_reason = NULL;
    }
    else
    {
        wifi_if_ctx_rtos->associated = true;
        memcpy(&wifi_if_ctx_rtos->assoc_bssid, mgmt->bssid, ETH_ALEN);

        event.assoc_info.addr           = mgmt->bssid;
        event.assoc_info.resp_frame     = frame;
        event.assoc_info.resp_frame_len = frame_len;
        event.assoc_info.freq           = wifi_if_ctx_rtos->assoc_freq;

        if (frame_len > 24 + sizeof(mgmt->u.assoc_resp))
        {
            event.assoc_info.resp_ies     = (unsigned char *)mgmt->u.assoc_resp.variable;
            event.assoc_info.resp_ies_len = (frame_len - 24 - sizeof(mgmt->u.assoc_resp));
        }
        if (assoc_resp->req_ie_len)
        {
            event.assoc_info.req_ies     = (unsigned char *)req_frame;
            event.assoc_info.req_ies_len = assoc_resp->req_ie_len;
        }
    }

    wifi_if_ctx_rtos->supp_callbk_fns.assoc_resp(wifi_if_ctx_rtos->supp_drv_if_ctx, &event, status);
}

void wifi_nxp_wpa_supp_event_proc_deauth(void *if_priv, nxp_wifi_event_mlme_t *deauth, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;
    const struct ieee80211_mgmt *mgmt = NULL;
    const unsigned char *frame        = NULL;
    unsigned int frame_len            = 0;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    frame     = (const unsigned char *)deauth->frame.frame;
    frame_len = deauth->frame.frame_len;
    mgmt      = (const struct ieee80211_mgmt *)frame;

    if (frame_len < 24 + sizeof(mgmt->u.deauth))
    {
        supp_e("%s: Deauthentication response frame too short", __func__);
        return;
    }

    memset(&event, 0, sizeof(event));

    event.deauth_info.addr        = &mgmt->sa[0];
    event.deauth_info.reason_code = le_to_host16(WLAN_REASON_DEAUTH_LEAVING);
    if (frame + frame_len > mgmt->u.deauth.variable)
    {
        event.deauth_info.ie     = mgmt->u.deauth.variable;
        event.deauth_info.ie_len = (frame + frame_len - mgmt->u.deauth.variable);
    }

