nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    bssid = params->bssid;

    if (num_chans != 0)
    {
        chan_list = os_mem_calloc(sizeof(wifi_scan_channel_list_t) * num_chans);

        if (chan_list != NULL)
        {
            wifi_nxp_sort_channels(channels, num_chans);
            for (i = 0; i < num_chans; i++)
            {
                chan_list[i].chan_number = channels[i];
                chan_list[i].scan_type   = MLAN_SCAN_TYPE_ACTIVE;
                chan_list[i].scan_time   = 100;
            }
        }
    }

    if (params->extra_ies_len)
    {
        status = wifi_set_scan_ies((void *)params->extra_ies, params->extra_ies_len);

        if (status != WM_SUCCESS)
        {
            wifi_d("wifi set scan IEs failed");
            goto out;
        }
    }

    wm_wifi.external_scan = false;
    wm_wifi.wpa_supp_scan = true;

#ifdef CONFIG_HOSTAPD
    wm_wifi.hostapd_op = false;

    if (wifi_if_ctx_rtos->hostapd)
    {
        wm_wifi.hostapd_op = true;
    }
#endif

    status = wifi_send_scan_cmd(bss_mode, bssid, ssid, ssid2, num_chans, chan_list, 0,
#ifdef CONFIG_SCAN_WITH_RSSIFILTER
                                params->filter_rssi,
#endif
#ifdef CONFIG_SCAN_CHANNEL_GAP
                                50U,
#endif
                                false, false);
    if (status != WM_SUCCESS)
    {
        wifi_d("wifi send scan cmd failed");
        goto out;
    }

    wifi_if_ctx_rtos->scan_in_progress = true;
    ret                                = 0;
out:
    if (chan_list != NULL)
    {
        os_mem_free((void *)chan_list);
    }

    return ret;
}

int wifi_nxp_wpa_supp_set_default_scan_ies(void *priv, const u8 *ies, size_t ies_len)
{
    int ret = -1;

    if ((!priv) || (!ies))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    ret = wifi_nxp_set_default_scan_ies(ies, ies_len);

    if (ret != WM_SUCCESS)
    {
        supp_e("%s: Default scan ies set failed", __func__);
    }
    else
    {
        supp_d("%s: Default scan ies set successfully", __func__);
    }
out:
    return ret;
}

int wifi_nxp_wpa_supp_sched_scan(void *if_priv, struct wpa_driver_scan_params *params)
{
    int status = -WM_FAIL;
    // struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret = -1;
    int i   = 0;
    nxp_wifi_trigger_sched_scan_t *wifi_sched_scan_params;

    if (!if_priv || !params)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    // wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    wifi_sched_scan_params = (nxp_wifi_trigger_sched_scan_t *)os_mem_calloc(sizeof(nxp_wifi_trigger_sched_scan_t));

    if (!wifi_sched_scan_params)
    {
        supp_e("%s:  wifi sched scan params calloc failed", __func__);
        goto out;
    }

    if (params->num_ssids != 0U)
    {
        wifi_sched_scan_params->num_ssids = MIN(WIFI_SCAN_MAX_NUM_SSIDS, params->num_ssids);

        for (i = 0; i < wifi_sched_scan_params->num_ssids; i++)
        {
            memcpy(wifi_sched_scan_params->scan_ssids[i].ssid, (const unsigned char *)params->ssids[i].ssid,
                   params->ssids[i].ssid_len);

            wifi_sched_scan_params->scan_ssids[i].ssid_len = params->ssids[i].ssid_len;
        }
    }

    for (i = 0; params->freqs[i] && i < WIFI_SCAN_MAX_NUM_CHAN; i++)
    {
        wifi_sched_scan_params->chan_list[i] = freq_to_chan(params->freqs[i]);
    }

    wifi_sched_scan_params->num_chans = i;

    if ((params->extra_ies) && (params->extra_ies_len))
    {
        memcpy(wifi_sched_scan_params->extra_ies.ie, params->extra_ies, params->extra_ies_len);
        wifi_sched_scan_params->extra_ies.ie_len = params->extra_ies_len;
    }

    wifi_sched_scan_params->chan_per_scan = MIN(WLAN_BG_SCAN_CHAN_MAX, wifi_sched_scan_params->num_chans);

    wifi_sched_scan_params->scan_interval = MIN_BGSCAN_INTERVAL;
    wifi_sched_scan_params->repeat_count  = 2;

    wifi_sched_scan_params->report_condition = BG_SCAN_SSID_MATCH | BG_SCAN_WAIT_ALL_CHAN_DONE;

    wifi_sched_scan_params->filter_rssi = params->filter_rssi;

    status = wifi_send_sched_scan_cmd(wifi_sched_scan_params);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: Sched Scan trigger failed", __func__);
        goto out;
    }
    ret = 0;
out:
    return ret;
}

int wifi_nxp_wpa_supp_stop_sched_scan(void *if_priv)
{
    int status = WM_SUCCESS;
    int ret    = -1;

    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    status = wifi_send_stop_sched_scan_cmd();
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi_supp_stop_sched_scan failed", __func__);
        goto out;
    }
    ret = 0;
out:
    return ret;
}

int wifi_nxp_wpa_supp_scan_abort(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int status                                 = -WM_FAIL;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (!wifi_if_ctx_rtos || (!wifi_if_ctx_rtos->scan_in_progress))
    {
        supp_d("%s:Ignore scan abort, no scan in progress", __func__);
        goto out;
    }

    wlan_abort_split_scan();

    status = WM_SUCCESS;

out:
    return status;
}

struct wpa_scan_res *wifi_nxp_wpa_supp_proc_scan_res(nxp_wifi_event_new_scan_result_t *scan_res)
{
    struct wpa_scan_res *r  = NULL;
    const unsigned char *ie = NULL;
    unsigned int ie_len     = 0;
    unsigned char *pos      = NULL;

    if (scan_res->ies.ie_len != 0U)
    {
        ie     = (const unsigned char *)scan_res->ies.ie;
        ie_len = scan_res->ies.ie_len;
    }

    r = (struct wpa_scan_res *)os_mem_calloc(sizeof(*r) + ie_len);

    if (!r)
    {
        supp_e("%s: Unable to calloc  memory for scan result\n", __func__);
        return NULL;
    }

    memcpy(r->bssid, scan_res->mac_addr, ETH_ALEN);

    r->freq = scan_res->frequency;

    r->beacon_int = scan_res->beacon_interval;

    r->caps = scan_res->capability;

    if (scan_res->noise == 0)
    {
        r->flags |= WPA_SCAN_NOISE_INVALID;
    }
    else
    {
        r->noise = scan_res->noise;
    }

    r->level = scan_res->rssi;

    r->flags |= WPA_SCAN_LEVEL_DBM | WPA_SCAN_QUAL_INVALID;

    (void)memcpy((void *)&r->tsf, (const void *)&scan_res->ies_tsf, sizeof(r->tsf));

