nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    if (!assoc_params)
    {
        supp_e("%s: assoc params calloc failed", __func__);
        goto out;
    }

    wifi_if_ctx_rtos->associated = false;

    if (params->auth_alg & WPA_AUTH_ALG_FT)
    {
        assoc_params->is_ft = true;
    }

    if (params->bssid)
    {
        memcpy(&wifi_if_ctx_rtos->attempt_bssid, params->bssid, ETH_ALEN);

        memcpy(assoc_params->bssid, params->bssid, sizeof(assoc_params->bssid));
    }

    if (params->freq.freq)
    {
        int channel           = freq_to_chan(params->freq.freq);
        assoc_params->channel = channel;

        wifi_if_ctx_rtos->assoc_freq = params->freq.freq;
    }
    else
    {
        wifi_if_ctx_rtos->assoc_freq = 0;
    }

    if (params->ssid)
    {
        assoc_params->ssid.ssid_len = params->ssid_len;

        memcpy(assoc_params->ssid.ssid, params->ssid, params->ssid_len);
    }

    if (params->wpa_ie)
    {
        assoc_params->wpa_ie.ie_len = params->wpa_ie_len;
        memcpy(assoc_params->wpa_ie.ie, params->wpa_ie, params->wpa_ie_len);
    }

    assoc_params->control_port = 1;

    wifi_d("initiating wifi-assoc");

    status = wifi_nxp_send_assoc(assoc_params);

    if (status != WM_SUCCESS)
    {
        supp_e("%s: MLME command failed (assoc)", __func__);
    }
    else
    {
        supp_d("%s: Association request sent successfully", __func__);
        ret = 0;
    }
    os_mem_free((void *)assoc_params);

out:
    return ret;
}

int wifi_nxp_wpa_supp_set_key(void *if_priv,
                              const unsigned char *ifname,
                              enum wpa_alg alg,
                              const unsigned char *addr,
                              int key_idx,
                              int set_tx,
                              const unsigned char *seq,
                              size_t seq_len,
                              const unsigned char *key,
                              size_t key_len,
                              enum key_flag key_flag)

{
    int status                                 = -WM_FAIL;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    unsigned int flags                         = 0;
    int ret                                    = -1;
    bool is_pairwise                           = false;
    int skip_set_key                           = 1;

    if ((!if_priv) || (!ifname))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;
    if ((key_flag & KEY_FLAG_PAIRWISE_MASK) == KEY_FLAG_PAIRWISE_RX_TX_MODIFY)
    {
        supp_d("SET_KEY (pairwise RX/TX modify)");
    }
    else if (alg == WPA_ALG_NONE && (key_flag & KEY_FLAG_RX_TX))
    {
        supp_d("%s: invalid key_flag to delete key", __func__);
        ret = -1;
        goto out;
    }
    else if (alg == WPA_ALG_NONE)
    {
        supp_d("DEL_KEY");

        status = wifi_remove_key(wifi_if_ctx_rtos->bss_type, is_pairwise, key_idx, addr);

        if (status != WM_SUCCESS)
        {
            supp_e("%s: wifi_nxp_del_key failed", __func__);
        }
        else
        {
            ret = 0;
        }
    }
    else
    {
        flags = wpa_alg_to_cipher_suite(alg, key_len);

        /* TODO: Implement/check set_tx */
        if (addr && !is_broadcast_ether_addr(addr))
        {
            is_pairwise = true;
            if ((key_flag & KEY_FLAG_PAIRWISE_MASK) == KEY_FLAG_PAIRWISE_RX ||
                (key_flag & KEY_FLAG_PAIRWISE_MASK) == KEY_FLAG_PAIRWISE_RX_TX_MODIFY)
            {
            }
            else if ((key_flag & KEY_FLAG_GROUP_MASK) == KEY_FLAG_GROUP_RX)
            {
            }
            else if (!(key_flag & KEY_FLAG_PAIRWISE))
            {
                supp_d("   key_flag missing PAIRWISE when setting a pairwise key");
                ret = -1;
                goto out;
            }
            else if (alg == WPA_ALG_WEP && (key_flag & KEY_FLAG_RX_TX) == KEY_FLAG_RX_TX)
            {
                supp_d("   unicast WEP key");
                skip_set_key = 0;
            }
            else
            {
                supp_d("   pairwise key");
            }
        }
        else if ((key_flag & KEY_FLAG_PAIRWISE) || !(key_flag & KEY_FLAG_GROUP))
        {
            supp_d("   invalid key_flag for a broadcast key");
            ret = -1;
            goto out;
        }
        else
        {
            supp_d("   broadcast key");
            is_pairwise = false;
            if (key_flag & KEY_FLAG_DEFAULT)
                skip_set_key = 0;
        }

        status =
            wifi_set_key(wifi_if_ctx_rtos->bss_type, is_pairwise, key_idx, key, key_len, seq, seq_len, addr, flags);

        if (status != WM_SUCCESS)
        {
            supp_e("%s: wifi_set_key failed", __func__);
        }
        else
        {
            ret = 0;
        }

        if (ret || skip_set_key)
            return ret;
    }
out:
    return ret;
}

int wifi_nxp_wpa_supp_set_rekey_info(
    void *if_priv, const u8 *kek, size_t kek_len, const u8 *kck, size_t kck_len, const u8 *replay_ctr)
{
    int status                                 = -WM_FAIL;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                                    = -1;

    if ((!if_priv) || (!kek) || (!kck) || (!replay_ctr))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    status = wifi_set_rekey_info(wifi_if_ctx_rtos->bss_type, kek, kek_len, kck, kck_len, replay_ctr);

    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi_set_rekey_info failed", __func__);
        goto out;
    }
    else
    {
        ret = 0;
    }

out:
    return ret;
}

int wifi_nxp_wpa_set_supp_port(void *if_priv, int authorized, char *bssid)
{
    int ret                                    = -1;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    if ((!if_priv) || (!bssid))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    wifi_d("initiating wifi-set-port authorized: %d", authorized);

