nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    hdr   = (const struct ieee80211_hdr *)data;
    fc    = le_to_host16(hdr->frame_control);
    stype = WLAN_FC_GET_STYPE(fc);

    if (!if_priv)
    {
        supp_e("%s: Missing interface context", __func__);
        goto out;
    }

    if (data_len > 1500)
    {
        supp_d("%s: Invalid data length", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    wifi_if_ctx_rtos->mgmt_tx_status = 0;

    status = wifi_nxp_send_mlme(wifi_if_ctx_rtos->bss_type, freq_to_chan(freq), wait_time, data, data_len);

    if (status == -WM_FAIL)
    {
        wifi_if_ctx_rtos->last_mgmt_tx_data_len = 0;
        wifi_if_ctx_rtos->mgmt_tx_status        = 0;
        supp_e("%s: wifi_inject_frame failed", __func__);
        goto out;
    }

    if (((wifi_if_ctx_rtos->bss_type == BSS_TYPE_UAP) &&
         ((stype == WLAN_FC_STYPE_ASSOC_RESP) || (stype == WLAN_FC_STYPE_REASSOC_RESP))) ||
        (stype == WLAN_FC_STYPE_ACTION))
    {
        memcpy((void *)wifi_if_ctx_rtos->last_mgmt_tx_data, (const void *)data, (size_t)data_len);
        wifi_if_ctx_rtos->last_mgmt_tx_data_len = data_len;
        wifi_if_ctx_rtos->mgmt_tx_status        = 1;
    }
    else
    {
        wifi_if_ctx_rtos->last_mgmt_tx_data_len = 0;
    }

out:
    return status;
}

int wifi_nxp_wpa_supp_remain_on_channel(void *if_priv, unsigned int freq, unsigned int duration)
{
    int status                                 = -WM_FAIL;
    int ret                                    = -1;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int channel;

    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }
    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;
    if (freq)
    {
        wifi_if_ctx_rtos->remain_on_channel_freq = freq;
    }
    wifi_if_ctx_rtos->remain_on_channel_duration = duration;

    channel = freq_to_chan(wifi_if_ctx_rtos->remain_on_channel_freq);

    wifi_if_ctx_rtos->supp_called_remain_on_chan = true;
    wifi_if_ctx_rtos->remain_on_chan_is_canceled = false;
    status                                       = wifi_remain_on_channel(true, channel, duration);

    if (status != WM_SUCCESS)
    {
        supp_e("%s: Remain on channel cmd failed", __func__);
        ret = -1;
    }
    else
    {
        supp_d("%s:Remain on channel sent successfully", __func__);
        ret = 0;
    }
out:
    return ret;
}

int wifi_nxp_wpa_supp_cancel_remain_on_channel(void *if_priv)
{
    int status                                 = -WM_FAIL;
    int ret                                    = -1;
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }
    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;
    if (wifi_if_ctx_rtos->remain_on_chan_is_canceled)
    {
        supp_d("%s:Already canceled, ignore it", __func__);
        ret = 0;
        goto out;
    }

    wifi_if_ctx_rtos->supp_called_remain_on_chan = true;
    wifi_if_ctx_rtos->remain_on_chan_is_canceled = true;
    status                                       = wifi_remain_on_channel(false, 0, 0);

    if (status != WM_SUCCESS)
    {
        supp_e("%s: Cancel on channel cmd failed", __func__);
        ret = -1;
    }
    else
    {
        supp_d("%s:Cancel on channel sent successfully", __func__);
        ret = 0;
    }
out:
    return ret;
}

void wifi_nxp_wpa_supp_event_proc_mgmt_rx(void *if_priv, nxp_wifi_event_mlme_t *mgmt_rx, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;
    const struct ieee80211_mgmt *mgmt = NULL;
    const unsigned char *frame        = NULL;
    unsigned int frame_len            = 0;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    frame     = (const unsigned char *)mgmt_rx->frame.frame;
    frame_len = mgmt_rx->frame.frame_len;
    mgmt      = (const struct ieee80211_mgmt *)frame;

    if (frame_len < 4 + (2 * WIFI_ETH_ADDR_LEN))
    {
        supp_e("%s: MLME event too short", __func__);
        return;
    }

    if (frame_len < 24 + sizeof(mgmt->u.deauth))
    {
        supp_e("%s: MGMT RX frame too short", __func__);
        return;
    }

    memset(&event, 0, sizeof(event));

    event.rx_mgmt.frame     = (const u8 *)mgmt;
    event.rx_mgmt.frame_len = frame_len;
    event.rx_mgmt.freq      = mgmt_rx->frame.freq;

#ifdef CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.mgmt_rx(wifi_if_ctx_rtos->hapd_drv_if_ctx, &event);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.mgmt_rx(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    }
}

void wifi_nxp_wpa_supp_event_proc_eapol_rx(void *if_priv, nxp_wifi_event_eapol_mlme_t *eapol_rx, unsigned int event_len)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    memset(&event, 0, sizeof(event));

    event.eapol_rx.src      = (const unsigned char *)eapol_rx->mac_addr;
    event.eapol_rx.data     = (const unsigned char *)eapol_rx->frame.frame;
    event.eapol_rx.data_len = eapol_rx->frame.frame_len;

#ifdef CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.eapol_rx(wifi_if_ctx_rtos->hapd_drv_if_ctx, &event);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.eapol_rx(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    }
}

void wifi_nxp_wpa_supp_event_proc_ecsa_complete(void *if_priv, nxp_wifi_ch_switch_info *ch_switch_info)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    union wpa_event_data event;

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    memset(&event, 0, sizeof(event));

    event.ch_switch.freq       = ch_switch_info->center_freq;
    event.ch_switch.ht_enabled = ch_switch_info->ht_enabled;
    event.ch_switch.ch_offset  = ch_switch_info->ch_offset;
    event.ch_switch.ch_width   = (enum chan_width)ch_switch_info->ch_width;
    event.ch_switch.cf1        = ch_switch_info->center_freq1;
    event.ch_switch.cf2        = ch_switch_info->center_freq2;

