nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
#ifdef CONFIG_HOSTAPD
    if (wifi_if_ctx_rtos->hostapd)
    {
        wifi_if_ctx_rtos->hostapd_callbk_fns.ecsa_complete(wifi_if_ctx_rtos->hapd_drv_if_ctx, &event);
    }
    else
#endif
    {
        wifi_if_ctx_rtos->supp_callbk_fns.ecsa_complete(wifi_if_ctx_rtos->supp_drv_if_ctx, &event);
    }
}

void *wifi_nxp_hostapd_dev_init(void *hapd_drv_if_ctx,
                                const char *iface_name,
                                rtos_hostapd_dev_callbk_fns *hostapd_callbk_fns)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    const struct netif *iface = NULL;

#ifdef CONFIG_ZEPHYR
    iface = net_if_get_binding(iface_name);
#else
    LOCK_TCPIP_CORE();
    iface = netif_find(iface_name);
    UNLOCK_TCPIP_CORE();
#endif

    if (!iface)
    {
        supp_e("%s: Interface %s not found", __func__, iface_name);
        return NULL;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)wm_wifi.hapd_if_priv;

    if (!wifi_if_ctx_rtos)
    {
        supp_e("%s: Interface %s not properly initialized", __func__, iface_name);
        return NULL;
    }

    memset(wifi_if_ctx_rtos, 0x00, sizeof(struct wifi_nxp_ctx_rtos));

    wifi_if_ctx_rtos->iface_ctx = iface;

    wifi_if_ctx_rtos->hostapd = true;

    wifi_if_ctx_rtos->bss_type = BSS_TYPE_UAP;

    wifi_if_ctx_rtos->hapd_drv_if_ctx = hapd_drv_if_ctx;

    wifi_if_ctx_rtos->last_mgmt_tx_data = (uint8_t *)os_mem_calloc(MAX_MGMT_TX_FRAME_SIZE);

    if (!wifi_if_ctx_rtos->last_mgmt_tx_data)
    {
        supp_e("%s: Buffer to store mgmt tx failed", __func__);
        return NULL;
    }

    memcpy(&wifi_if_ctx_rtos->hostapd_callbk_fns, hostapd_callbk_fns, sizeof(wifi_if_ctx_rtos->hostapd_callbk_fns));

    return wifi_if_ctx_rtos;
}

void wifi_nxp_hostapd_dev_deinit(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    if (wifi_if_ctx_rtos != NULL)
    {
        os_mem_free((void *)wifi_if_ctx_rtos->last_mgmt_tx_data);
        memset(wifi_if_ctx_rtos, 0x00, sizeof(struct wifi_nxp_ctx_rtos));
    }
}

int wifi_nxp_hostapd_set_modes(void *if_priv, struct hostapd_hw_modes *modes)
{
    int status = -WM_FAIL;
    t_u8 bandwidth = wifi_uap_get_bandwidth();

    if ((!if_priv) || (!modes))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    status = wifi_setup_ht_cap(&modes[HOSTAPD_MODE_IEEE80211G].ht_capab, &modes[HOSTAPD_MODE_IEEE80211G].mcs_set[0],
                               &modes[HOSTAPD_MODE_IEEE80211G].a_mpdu_params, 0);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 2G infra ht cap failed", __func__);
        goto out;
    }

#ifdef CONFIG_5GHz_SUPPORT
    status = wifi_setup_ht_cap(&modes[HOSTAPD_MODE_IEEE80211A].ht_capab, &modes[HOSTAPD_MODE_IEEE80211A].mcs_set[0],
                               &modes[HOSTAPD_MODE_IEEE80211A].a_mpdu_params, 1);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 5G infra ht cap failed", __func__);
        goto out;
    }
#endif

    modes[HOSTAPD_MODE_IEEE80211G].flags |= HOSTAPD_MODE_FLAG_HT_INFO_KNOWN;
#ifdef CONFIG_5GHz_SUPPORT
    modes[HOSTAPD_MODE_IEEE80211A].flags |= HOSTAPD_MODE_FLAG_HT_INFO_KNOWN;
#endif

#ifdef CONFIG_11AC
    status = wifi_setup_vht_cap((t_u32 *)&modes[HOSTAPD_MODE_IEEE80211G].vht_capab,
                                modes[HOSTAPD_MODE_IEEE80211G].vht_mcs_set, 0);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 2G infra vht cap failed", __func__);
        goto out;
    }

#ifdef CONFIG_5GHz_SUPPORT
    status = wifi_setup_vht_cap((t_u32 *)&modes[HOSTAPD_MODE_IEEE80211A].vht_capab,
                                modes[HOSTAPD_MODE_IEEE80211A].vht_mcs_set, 1);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 5G infra vht cap failed", __func__);
        goto out;
    }
#endif

    modes[HOSTAPD_MODE_IEEE80211G].flags |= HOSTAPD_MODE_FLAG_VHT_INFO_KNOWN;
#ifdef CONFIG_5GHz_SUPPORT
    modes[HOSTAPD_MODE_IEEE80211A].flags |= HOSTAPD_MODE_FLAG_VHT_INFO_KNOWN;
#endif
#endif

#ifdef CONFIG_11AX
    status = wifi_setup_he_cap(
        (nxp_wifi_he_capabilities *)&modes[HOSTAPD_MODE_IEEE80211G].he_capab[IEEE80211_MODE_INFRA], 0);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 2G infra he cap failed", __func__);
        goto out;
    }

    status =
        wifi_setup_he_cap((nxp_wifi_he_capabilities *)&modes[HOSTAPD_MODE_IEEE80211G].he_capab[IEEE80211_MODE_AP], 0);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 2G ap he cap failed", __func__);
        goto out;
    }
    if (bandwidth == BANDWIDTH_20MHZ)
    {
        modes[HOSTAPD_MODE_IEEE80211G].he_capab[IEEE80211_MODE_AP].phy_cap[HE_PHYCAP_CHANNEL_WIDTH_SET_IDX] = 0;
    }
#ifdef CONFIG_5GHz_SUPPORT
    status = wifi_setup_he_cap(
        (nxp_wifi_he_capabilities *)&modes[HOSTAPD_MODE_IEEE80211A].he_capab[IEEE80211_MODE_INFRA], 1);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 5G infra he cap failed", __func__);
        goto out;
    }

    status =
        wifi_setup_he_cap((nxp_wifi_he_capabilities *)&modes[HOSTAPD_MODE_IEEE80211A].he_capab[IEEE80211_MODE_AP], 1);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp set 5G ap he cap failed", __func__);
        goto out;
    }
    if (bandwidth == BANDWIDTH_20MHZ)
    {
        modes[HOSTAPD_MODE_IEEE80211A].he_capab[IEEE80211_MODE_AP].phy_cap[HE_PHYCAP_CHANNEL_WIDTH_SET_IDX] = 0;
    }
#endif
#endif

    wifi_setup_channel_info(modes[HOSTAPD_MODE_IEEE80211B].channels, modes[HOSTAPD_MODE_IEEE80211B].num_channels,
                            BAND_2GHZ);
    wifi_setup_channel_info(modes[HOSTAPD_MODE_IEEE80211G].channels, modes[HOSTAPD_MODE_IEEE80211G].num_channels,
                            BAND_2GHZ);
#ifdef CONFIG_5GHz_SUPPORT
    wifi_setup_channel_info(modes[HOSTAPD_MODE_IEEE80211A].channels, modes[HOSTAPD_MODE_IEEE80211A].num_channels,
                            BAND_5GHZ);
#endif

    status = WM_SUCCESS;

out:
    return status;
}

