nxp-appcodehub/dm-wifi-lcd-connect-frdm-mcxn947/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    if (params->ht_capabilities)
    {
        memcpy(&sta_params->ht_capab, params->ht_capabilities, sizeof(struct ieee80211_ht_capabilities));
        sta_params->ht_capab_len = sizeof(struct ieee80211_ht_capabilities);
    }

    if (params->vht_capabilities)
    {
        memcpy(&sta_params->vht_capab, params->vht_capabilities, sizeof(struct ieee80211_vht_capabilities));
        sta_params->vht_capab_len = sizeof(struct ieee80211_vht_capabilities);
    }

    if (params->he_capab)
    {
        memcpy(&sta_params->he_capab, params->he_capab, sizeof(struct ieee80211_he_capabilities));
        sta_params->he_capab_len = params->he_capab_len;
    }

    status = wifi_nxp_sta_add(sta_params);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp sta add failed", __func__);
    }
out:
    if (sta_params != NULL)
    {
        os_mem_free((void *)sta_params);
    }
    return status;
}

int wifi_nxp_hostapd_sta_remove(void *if_priv, const u8 *addr)
{
    int status = -WM_FAIL;

    if ((!if_priv) || (!addr))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    status = wifi_nxp_sta_remove(addr);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp sta remove failed", __func__);
    }
out:
    return status;
}

int wifi_nxp_hostapd_send_eapol(void *if_priv, const u8 *data, size_t data_len)
{
    int ret = -1;
    if ((!if_priv) || (!data))
    {
        supp_e("%s: Invalid params\n", __func__);
        goto out;
    }

    ret = wifi_supp_inject_frame(WLAN_BSS_TYPE_UAP, data, data_len);

out:
    return ret;
}

int wifi_nxp_hostapd_set_freq(void *if_priv, struct hostapd_freq_params *freq)
{
    int ret = -1;
    nxp_wifi_chan_info_t chan;

    if ((!if_priv) || (!freq))
    {
        supp_e("%s: Invalid params\n", __func__);
        goto out;
    }

    memset(&chan, 0x00, sizeof(nxp_wifi_chan_info_t));

#if 0
    PRINTF("freq->freq: %d\r\n", freq->freq);
    PRINTF("freq->channel: %d\r\n", freq->channel);
    PRINTF("freq->ht_enabled: %d\r\n", freq->ht_enabled);
    PRINTF("freq->sec_channel_offset: %d\r\n", freq->sec_channel_offset);
    PRINTF("freq->vht_enabled: %d\r\n", freq->vht_enabled);
    PRINTF("freq->he_enabled: %d\r\n", freq->he_enabled);
    PRINTF("freq->bandwidth: %d\r\n", freq->bandwidth);
#endif
    ret = 0;

    chan.mode               = (enum wifi_mode)freq->mode;
    chan.freq               = freq->freq;
    chan.channel            = freq->channel;
    chan.sec_channel_offset = freq->sec_channel_offset;
    chan.bandwidth          = freq->bandwidth;
    chan.ht_enabled         = freq->ht_enabled;
    chan.vht_enabled        = freq->vht_enabled;
    chan.he_enabled         = freq->he_enabled;
    chan.center_freq1       = freq->center_freq1;
    chan.center_freq2       = freq->center_freq2;

    ret = 0; // wifi_nxp_set_chan(chan);

out:
    return ret;
}

int wifi_nxp_hostapd_set_rts(void *if_priv, int rts_threshold)
{
    int ret = -1;
    if (!if_priv)
    {
        supp_e("%s: Invalid params\n", __func__);
        goto out;
    }

    // ret = wifi_nxp_set_rts(rts_threshold);
    ret = wifi_set_uap_rts(rts_threshold);

out:
    return ret;
}

int wifi_nxp_hostapd_set_frag(void *if_priv, int frag_threshold)
{
    int ret = -1;
    if (!if_priv)
    {
        supp_e("%s: Invalid params\n", __func__);
        goto out;
    }

    ret = wifi_set_uap_frag(frag_threshold);

out:
    return ret;
}

int wifi_nxp_hostapd_stop_ap(void *if_priv)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                                    = -1;
    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    ret = wifi_nxp_stop_ap();
    if (ret != 0)
    {
        supp_e("%s: Stop AP failed", __func__);
        goto out;
    }
    wifi_if_ctx_rtos->uap_started = false;
out:
    return ret;
}

int wifi_nxp_hostapd_set_acl(void *if_priv, struct hostapd_acl_params *params)
{
    // struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;
    int ret                         = -1;
    nxp_wifi_acl_info_t *acl_params = NULL;
    size_t acl_sz                   = 0;
    unsigned int i;

    if ((!if_priv) || (!params))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    // wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;

    acl_sz = WIFI_ETH_ADDR_LEN * params->num_mac_acl;

    acl_params = (nxp_wifi_acl_info_t *)os_mem_calloc(sizeof(nxp_wifi_acl_info_t) + acl_sz);
    if (!acl_params)
    {
        supp_e("%s: acl params calloc failed", __func__);
        goto out;
    }

    acl_params->acl_policy  = params->acl_policy;
    acl_params->num_mac_acl = params->num_mac_acl;

    for (i = 0; i < params->num_mac_acl; i++)
    {
        memcpy(acl_params->mac_acl[i].addr, params->mac_acl[i].addr, WIFI_ETH_ADDR_LEN);
    }

    ret = wifi_nxp_set_acl(acl_params);
    if (ret != 0)
    {
        supp_e("%s: Set ACL failed", __func__);
    }

out:
    if (acl_params)
        os_mem_free((void *)acl_params);
    return ret;
}

int wifi_nxp_wpa_dpp_listen(void *if_priv, bool enable)
{
    struct wifi_nxp_ctx_rtos *wifi_if_ctx_rtos = NULL;

    if (!if_priv)
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    wifi_if_ctx_rtos = (struct wifi_nxp_ctx_rtos *)if_priv;
    if (enable && (wifi_if_ctx_rtos->bss_type == BSS_TYPE_STA))
    {
        return wifi_set_rx_mgmt_indication(wifi_if_ctx_rtos->bss_type, WLAN_MGMT_ACTION);
    }
    else
    {
        return 0;
    }

out:
    return -1;
}

#endif
